minzhao-enar2014.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>(Quantile Regression in the Presence of Monotone Missingness with Sensitivity Analysis)</title>
<meta name="author" content="(Minzhao Liu, Mike Daniels)"/>
<link rel="stylesheet" href="file:///Users/liuminzhao/dev/reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="file:///Users/liuminzhao/dev/reveal.js/css/theme/moon.css" id="theme"/>

<link rel="stylesheet" href="file:///Users/liuminzhao/dev/reveal.js/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Quantile Regression in the Presence of Monotone Missingness with Sensitivity Analysis</h1>
<h2>Minzhao Liu, Mike Daniels</h2>
<h2><a href="mailto:liuminzhao@ufl.edu">liuminzhao@ufl.edu</a></h2>
<h2>2014-03-19</h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">Introduction</a>
</li>
<li>
<a href="#sec-2">Model Settings</a>
</li>
<li>
<a href="#sec-3">Missing Data Mechanism</a>
</li>
<li>
<a href="#sec-4">Estimation</a>
</li>
<li>
<a href="#sec-5">Real Data Analysis: Tours</a>
</li>
<li>
<a href="#sec-6">Summary</a>
</li>
</ul>
</section>

<section id="sec-1" >

<h2>Introduction</h2>
<ul class="org-ul">
<li>Missing data mechanism (MDM)
</li>
<li>Notation
</li>
<li>Pattern mixture models
</li>
</ul>

</section>
<section>
<section id="sec-1-1" >

<h3>Missing Data Mechanism</h3>
<ul class="org-ul">
<li>Missing data mechanism: $$p( \mathbf r|  y,  x,  \phi(\mathbf \omega))$$
</li>
<li>Missing Complete At Random (MCAR): $$p(\mathbf r |  y_{obs}, y_{mis}, \mathbf x, \mathbf \phi) =   p(\mathbf r | \mathbf x, \mathbf \phi)$$
</li>
<li>Missing At Random (MAR): $$ p(\mathbf r |  y_{obs}, y_{mis}, \mathbf x, \mathbf \phi) =   p(\mathbf r | y_{obs}, \mathbf x, \mathbf \phi)$$
</li>
<li>Missing Not At Random (MNAR), for \(y_{mis} \neq y_{mis}\prime\): $$p(\mathbf r |  y_{obs}, y_{mis}, \mathbf x, \mathbf \phi) \neq   p(\mathbf r | y_{obs}, y_{mis}\prime, \mathbf x, \mathbf \phi)$$
</li>
</ul>
</section>
</section>
<section>
<section id="sec-1-2" >

<h3>Notation</h3>
<ul class="org-ul">
<li>Under monotone dropout, WOLOG, denote $$S_i \in \{1, 2, \ldots, J\}$$
to be the number of observed \(Y_{ij}'s\) for subject \(i\),
</li>
<li>\(\mathbf Y_i = (Y_{i1}, Y_{i2}, \ldots, Y_{iJ})^{T}\) to be the full
data response vector for subject \(i\),
</li>
<li>\(J\) is the maximum follow up time.
</li>
<li>We assume \(Y_{i1}\) is always observed.
</li>
</ul>

</section>
<section>

<ul class="org-ul">
<li>We are interested in the \(\tau\)-th marginal quantile regression
coefficients
$$\mathbf \gamma_j = (\gamma_{j1}, \gamma_{j2}, \ldots, \gamma_{jp})^T$$,
$$
     Pr (Y_{ij} \leq \mathbf x_i^{T} \mathbf \gamma_j ) = \tau $$
where \(\mathbf x_i\) is a \(p \times 1\) vector of covariates for
subject \(i\).
</li>
<li>Let $$
     p_k(Y) = p(Y | S = k), \quad  p_{\geq k} (Y)  = p(Y | S \geq k)
   $$ be the densities of response \(\mathbf Y\) given follow-up time
\(S=k\) and \(S \geq k\). And \(Pr_k\) be the corresponding probability
given \(S = k\).
</li>
</ul>
</section>
</section>
<section>
<section id="sec-1-3" >

<h3>Pattern Mixture Model</h3>
<ul class="org-ul">
<li>Mixture models factor the joint distribution of response and
missingness as $$
     p (\mathbf y, \mathbf S |\mathbf x, \mathbf \omega) = p (\mathbf y|\mathbf S, \mathbf x, \mathbf \omega) p (\mathbf S | \mathbf x, \mathbf \omega).
   $$
</li>
<li>The full-data response distribution is given by $$
     p (\mathbf y | \mathbf x, \mathbf \omega) = \sum_{S \in \mathcal{S}} p(\mathbf y| \mathbf S, \mathbf x, \mathbf \theta) p (\mathbf S | \mathbf x, \mathbf \phi),
   $$ where \(\mathcal{S}\) is the sample space for dropout time \(S\) and
the parameter vector \(\mathbf \omega\) is partitioned as
\((\mathbf \theta, \mathbf \phi)\).
</li>
<li>Furthermore, the conditional distribution of response within patterns
can be decomposed as $$
     P (Y_{obs}, Y_{mis} | \mathbf S, \mathbf \theta) = P
     (Y_{mis}|Y_{obs}, \mathbf S, \mathbf \theta_E) P (Y_{obs} | \mathbf S, \mathbf
     \theta_{y, O}),
   $$
</li>
<li>\(\mathbf \theta_E\): extrapolation distribution
</li>
<li>\(\mathbf \theta_{y, O}\) : distribution of observed responses
</li>
</ul>
</section>
</section>
<section id="sec-2" >

<h2>Model Settings</h2>
<ul class="org-ul">
<li>Multivariate normal distributions within pattern
</li>
<li>The marginal quantile regression models as: $$
     Pr (Y_{ij} \leq \mathbf x_{i}^T \mathbf \gamma_j ) = \tau$$
</li>
<li>For \(j = 1\):$$ p_k(y_{i1}) = N (\Delta_{i1} +  \beta_1^{(k)},
      \sigma_1^{(k)}  ), k = 1, \ldots, J$$
</li>
<li>For \(2 \leq j \leq J\):
\begin{array}{l}
     \displaystyle p_k(y_{ij}|\mathbf y_{ij^{-}}) =
    \begin{cases}
      \textrm{N} \big (\Delta_{ij} + \mathbf y_{ij^{-}}^T \mathbf
      \beta_{y,j-1},
      \sigma_j \big), & k \geq j ;  \\
      \textrm{N} \big ( \chi(\mathbf x_{i}, \mathbf y_{ij^{-}}),
      \sigma_j \big), & k < j ;  \\
    \end{cases}
  \end{array}
</li>
<li>For \(S\): $$ S_{i} = k \sim \textrm{Multinomial}(1, \mathbf \phi)$$
</li>
</ul>

</section>
<section>
<section id="sec-2-1" >

<h3>Intuition</h3>
<ul class="org-ul">
<li>Embed the marginal quantile regressions directly in the model through
constraints in the likelihood of pattern mixture models
</li>
<li>The mixture model allows the marginal quantile regression
coefficients to differ by quantiles. Otherwise, the quantile lines
would be parallel to each other.
</li>
<li>The mixture model also allows sensitivity analysis.
</li>
</ul>
</section>
</section>
<section id="sec-3" >

<h2>Missing Data Mechanism</h2>
<ul class="org-ul">
<li>Mixture models are not identified due to insufficient information
provided by observed data.
</li>
<li>Specific forms of missingness are needed to induce constraints to
identify the distributions for incomplete patterns, in particular,
the extrapolation distribution
</li>
<li>In mixture models , MAR holds (Molenberghs et al. 1998; Wang &amp;
Daniels, 2011) if and only if, for each \(j \geq 2\) and \(k < j\): $$
     p_k(y_j|y_1, \ldots, y_{j-1}) = p_{\geq j}(y_j|y_1, \ldots, y_{j-1}).
   $$
</li>
<li>When \(2 \leq j \leq J\) and \(k < j\), \(Y_j\) is not observed, thus
   \(h_0^{(k)}\) can not be identified from the observed data.
</li>
</ul>

</section>
<section>
<section id="sec-3-1" >

<h3>Sensitivity Analysis</h3>
<ul class="org-ul">
<li>Thus \(\mathbf \xi_s=(h_0^{(k)})\) is a set of sensitivity parameters (Daniels &amp; Hogan, 2008), where \(k =1, ..., J-1\).
</li>
<li>\(\mathbf \xi_s = \mathbf \xi_{s0} = \mathbf 0\), MAR holds.
</li>
<li>\(\mathbf \xi_s\) is fixed at \(\mathbf \xi_s \neq \mathbf \xi_{s0}\),
MNAR.
</li>
<li>We can vary \(\mathbf \xi_s\) around \(\mathbf 0\) to examine the impact
of different MNAR mechanisms.
</li>
</ul>
</section>
</section>
<section>
<section id="sec-3-2" >

<h3>Calculation of \(\Delta_{ij}\) (\(j = 1\))</h3>
<ul class="org-ul">
<li>\(\Delta_{ij}\) depends on subject-specific covariates \(\mathbf x_{i}\), thus \(\Delta_{ij}\) needs to be calculated for each subject.
</li>
<li>\(\Delta_{i1}\): $$ \tau = \sum_{k = 1}^J \phi_k \Phi \left( \frac{\mathbf x_{i1}^T
        \mathbf \gamma_1 - \Delta_{i1} - \mathbf x_{i1}^T\mathbf
        \beta_1^{(k)}}{ \sigma_1^{(k)} } \right)$$
</li>
<li>The equation is continuous and monotone in \(\Delta_{i1}\)
</li>
<li>Thus it can be solved by a standard numerical root-finding method (e.g. bisection method) with minimal difficulty.
</li>
</ul>
</section>
</section>
<section>
<section id="sec-3-3" >

<h3>Calculation of \(\Delta_{ij}, 2\leq j \leq J\)</h3>
<p>
Lemma:
</p>

\begin{array}{l}
\displaystyle \int \Phi \left( \frac{x-b}{a} \right) d\Phi(x; \mu, \sigma)  =
\begin{cases}
1- \Phi \left( \frac{b-\mu}{\sigma} \big /
\sqrt{\frac{a^2}{\sigma^2}+1} \right) & a > 0, \\
\Phi \left( \frac{b-\mu}{\sigma} \big /
\sqrt{\frac{a^2}{\sigma^2}+1} \right) & a < 0,
\end{cases}
\end{array}

</section>
<section>

<p>
Recursively for the first multiple integral, apply lemma once to obtain:
</p>

\begin{align*}
  Pr_1 (Y_{ij} \leq \mathbf x_{i}^T \mathbf \gamma_j) & =
  \idotsint
  Pr_1 (Y_{ij} \leq \mathbf x_{i}^T\mathbf \gamma_j |\mathbf x_{i}, \mathbf Y_{ij^{-}})\\
  & \quad  dF_1(Y_{i(j-1)}|\mathbf x_{i}, \mathbf Y_{i(j-1)^{-}}) \cdots d F_1 (Y_{i1} |\mathbf x_{i}), \\
  & = \idotsint \Phi \left( \frac{Y_{i(j-2)} - b^{*}}{a^{*}}
  \right) dF_1(Y_{i(j-2)}|\mathbf x_{i}, \mathbf Y_{i(j-2)^{-}})\cdots d F_1 (Y_{i1} | \mathbf x_{i}).
\end{align*}

<p>
Then, by recursively applying lemma \((j-1)\) times, each multiple
integral in equation can be simplified to single normal CDF.
</p>
</section>
</section>
