minzhao-enar2014.org
* Estimation

The observed data likelihood for an individual $i$ with follow-up time
$S_i = k$ is
\begin{align}
L_i(\mathbf \xi| \mathbf y_i, S_{i} = k) & =
  \phi_kp_k (y_k | y_1, \ldots, y_{k-1})
  p_k (y_{k-1}|y_1, \ldots, y_{k-2}) \cdots p_{k} (y_1), \\
  & = \phi_k p_{\geq k} (y_k | y_1, \ldots, y_{k-1}) p_{\geq k-1}
  (y_{k-1}|y_1, \ldots, y_{k-2}) \cdots p_{k} (y_1), \nonumber
\end{align}

- Use the bootstrap to construct confidence interval and make
inferences.

** Goodness of Fit Check

#+BEGIN_HTML
  <!-- A simple goodness-of-fit check can be done by examining normal QQ -->
  <!-- plots of the fitted residuals from the model. The visual test can help -->
  <!-- to diagnose if the parametric assumptions are suitable for model. -->
#+END_HTML

-  Check QQ plots of fitted residuals

#+BEGIN_HTML
  <!-- After obtaining the MLE, we use the aboved approach to -->
  <!--  get the fitted $\Delta_{ij}$ for each -->
  <!-- subject. Then the fitted residuals can be obtained by plugging in the -->
  <!-- fitted estimates and $\hat{\Delta}_{ij}$ to obtain, -->
#+END_HTML

$$
  \hat{\epsilon}_{ij} =
  \begin{cases}
    (y_{ij} - \hat{\Delta}_{ij} - \mathbf{x_{i}^T
    \hat{\beta}_1^{(k)}})/\hat{\sigma}_1^{(k)},& j = 1 \\
    (y_{ij} - \hat{\Delta}_{ij} - \mathbf{y_{ij^{-}}^T
    \hat{\beta}_{y,j-1}^{(\geq j)}})/\hat{\sigma}_j^{(\geq j)},& j >
    1
  \end{cases}.
$$

