minzhao-enar2014.html
<section id="sec-4" >

<h2>Estimation</h2>
<p>
The observed data likelihood for an individual \(i\) with follow-up time
\(S_i = k\) is
</p>
\begin{align}
L_i(\mathbf \xi| \mathbf y_i, S_{i} = k) & =
  \phi_kp_k (y_k | y_1, \ldots, y_{k-1})
  p_k (y_{k-1}|y_1, \ldots, y_{k-2}) \cdots p_{k} (y_1), \\
  & = \phi_k p_{\geq k} (y_k | y_1, \ldots, y_{k-1}) p_{\geq k-1}
  (y_{k-1}|y_1, \ldots, y_{k-2}) \cdots p_{k} (y_1), \nonumber
\end{align}

<ul class="org-ul">
<li>Use the bootstrap to construct confidence interval and make
</li>
</ul>
<p>
inferences.
</p>

</section>
<section>
<section id="sec-4-1" >

<h3>Goodness of Fit Check</h3>
<!-- A simple goodness-of-fit check can be done by examining normal QQ -->
<!-- plots of the fitted residuals from the model. The visual test can help -->
<!-- to diagnose if the parametric assumptions are suitable for model. -->

<ul class="org-ul">
<li>Check QQ plots of fitted residuals
</li>
</ul>

<!-- After obtaining the MLE, we use the aboved approach to -->
<!--  get the fitted $\Delta_{ij}$ for each -->
<!-- subject. Then the fitted residuals can be obtained by plugging in the -->
<!-- fitted estimates and $\hat{\Delta}_{ij}$ to obtain, -->

<p>
$$
  \hat{\epsilon}<sub>ij</sub> =
</p>
<p>
  \begin{cases}
    (y<sub>ij</sub> - \hat{\Delta}<sub>ij</sub> - \mathbf{x<sub>i</sub><sup>T</sup>
    \hat{\beta}<sub>1</sub><sup>(k)</sup>})/\hat{\sigma}<sub>1</sub><sup>(k)</sup>,&amp; j = 1 <br  />
    (y<sub>ij</sub> - \hat{\Delta}<sub>ij</sub> - \mathbf{y<sub>ij<sup>-</sup></sub><sup>T</sup>
    \hat{\beta}<sub>y,j-1</sub><sup>(&ge; j)</sup>})/\hat{\sigma}<sub>j</sub><sup>(&ge; j)</sup>,&amp; j &gt;
    1
  \end{cases}.
$$
</p>
</section>
</section>
