minzhao-enar2014.org
** Curse of Dimensionality

Each pattern $S = k$ has its own set of SP $\mathbf \xi_s^{(k)}$.
However, to keep the number of SP at a manageable level, we assume
$\mathbf \xi_s$ does not depend on pattern.

#+BEGIN_HTML
  <!-- --- -->

  <!-- ## Bayesian MCMC -->

  <!-- For Bayesian inference, we specify priors on the parameters $\mathbf -->
  <!-- \xi$ and use a block Gibbs sampling method to draw samples from the -->
  <!-- posterior distribution. Denote all the parameters to sample as : -->
  <!-- $$ -->
  <!-- \begin{align*} -->
  <!--   \mathbf \xi_m &= \left\{ \mathbf \gamma_j, -->
  <!--     \mathbf \beta_{y,j-1}^{(\geq j)}, \mathbf \alpha_j^{(\geq j)} \right\} -->
  <!--   \mbox{ for } j = 1, \ldots, J ,\\ -->
  <!--   \mathbf \xi_s &= \left\{ \mathbf h_j^{(k)}, \mathbf \eta_{j-1}^{(k)},  \delta_j^{(k)} -->
  <!--   \right\} -->
  <!--   \mbox{ for } k = 1, \ldots, j-1; 2 \leq j \leq J. -->
  <!-- \end{align*} -->
  <!-- $$ -->
  <!-- Comma separated parameters are marked to sample as a block.  Updates -->
  <!-- of $\mathbf \xi_m$ require a Metropolis-Hasting algorithm, while -->
  <!-- $\mathbf \xi_s$ samples are drawn directly from priors as desired for -->
  <!-- missingness mechanism assumptions. -->

  <!-- --- -->

  <!-- ## Updating -->

  <!-- - MAR or MNAR assumptions are implemented via specific priors. -->
  <!-- - Details for updating parameters are: -->
  <!--    - $\mathbf \gamma_{1} $: Use Metropolis-Hasting algorithm. -->
  <!--      - Draw ($\mathbf \gamma_{1}^c$) candidates from candidate -->
  <!--          distribution; -->
  <!--      - Based on the new candidate parameter $\mathbf \xi^c$, calculate -->
  <!--      candidate $\Delta_{ij}^c$ for each subject $i$ -->
  <!--      - Plug in $\Delta_{ij}^c$ in likelihood to get -->
  <!--          candidate likelihood; -->
  <!--      - Compute Metropolis-Hasting ratio, and accept the candidate -->
  <!--          value or keep the previous value. -->
  <!--    - For the rest of the identifiable parameters, algorithms for -->
  <!--      updating the samples are all similar to $\mathbf \gamma_j$. -->
  <!--    - For sensitivity parameters, because we do not get any -->
  <!--    information from the data, we sample them from priors, which are -->
  <!--    specified based on assumptions about the missingness. -->

  <!-- --- -->

  <!-- ## Simulation Study -->

  <!-- ### Method candidates -->

  <!-- - *rq* function (noted as RQ) in *quantreg* R package (<a href="http://CRAN.R-project.org/package=quantreg">Koenker, 2012</a>) -->
  <!-- - Bottai's algorithm (<a href="http://dx.doi.org/10.2427/8758">Bottai & Zhen, 2013</a>) (noted as BZ). -->
  <!-- - <a href="http://dx.doi.org/10.2427/8758">Bottai & Zhen (2013)</a> impute missing -->
  <!--   outcomes using the estimated conditional quantiles of missing outcomes -->
  <!--   given observed data. Their approach does not make distributional -->
  <!--   assumptions similar to *rq* and assumes ignorable missing data. -->

  <!-- --- &twocol -->

  <!-- ## Simulation Study Design -->

  <!-- Candidate: *RQ*, *BZ* (Bottai 2013), Our proposed method -->

  <!-- *** left -->

  <!-- - Scenario 1: MAR -->
  <!-- - Scenario 2: MNAR with misspecification -->
  <!-- - Scenario 3: MNAR with correct MNAR MDM -->
  <!-- - Bivariate responses, $Y_2$ were partly missing -->
  <!-- - For each scenario, -->
  <!--   - N(0, 1) -->
  <!--   - $T_3$ -->
  <!--   - Laplace distribution (rate = 1) -->
  <!-- - 100 data sets. For each set there are 200 bivariate observations -->
  <!-- - Covariate $x$ was sampled from Uniform(0,2). -->

  <!-- *** right -->

  <!-- - The three models for the -->
  <!--   full data response $\mathbf Y_i$ were: -->
  <!-- $$ -->
  <!-- \begin{align*} -->
  <!--   Y_{i1} | R = 1 & \sim 2 + x_i +  \epsilon_{i1} , \\ -->
  <!--   Y_{i1}| R = 0 & \sim  -2 - x_i +  \epsilon_{i1} , \\ -->
  <!--   Y_{i2}| R = 1, Y_{i1}&\sim 1 - x_i - 1/2Y_{i1} + \epsilon_{i2}, -->
  <!-- \end{align*} -->
  <!-- $$ -->
  <!-- - $Pr (R = 1) = 0.5$ -->
  <!-- - When $R = 0$, $Y_{i2}$ is not observed, so $p(Y_{i2}| R = 0, Y_{i1})$ is not identifiable from -->
  <!--   observed data. -->
  <!-- - S2 and S3:  assume -->
  <!-- $$Y_{i2}| R = 0, Y_{i1} \sim 3 - x_i - 1/2Y_{i1} + \epsilon_{i2}$$ -->

  <!-- <\!-- Under an MAR assumption, the sensitivity parameter $\mathbf \xi_s$ is -\-> -->
  <!-- <\!-- fixed at $\mathbf 0$. For -\-> -->
  <!-- <\!-- *rq* function from *quantreg* R package, because only -\-> -->
  <!-- <\!-- $Y_{i2}|R = 1$ is observed, the quantile regression for $Y_{i2}$ can -\-> -->
  <!-- <\!-- only be fit from the information of $Y_{i2}|R = 1$ vs $x$. -\-> -->

  <!-- --- -->

  <!-- ## Evaluation -->

  <!-- - Fit quantile regression for quantiles $\tau =$ 10%, 30%, 50%, 70%, 90% -->
  <!-- - Parameter estimates were evaluated by mean -->
  <!--   squared error (MSE), -->
  <!-- $$ -->
  <!--   \mbox{MSE} (\gamma_{ij}) = \frac{1}{100} \sum_{k = 1}^{100} -->
  <!--   \left( \hat{\gamma}_{ij}^{(k)}  - \gamma_{ij}\right)^2, i = 0, 1 -->
  <!-- $$ -->
  <!-- where $\gamma_{j}$ is the true value for quantile regression -->
  <!-- coefficient, $\hat{\gamma}_{j}^{(k)}$ is the maximum likelihood -->
  <!-- estimates in $k$-th simulated dataset ($(\gamma_{01}, \gamma_{11})$ -->
  <!-- for $Y_{i1}$, $(\gamma_{02}, \gamma_{12})$ for $Y_{i2}$). -->

  <!-- Monte Carlo standard error (MCSE) is used to evaluate the significance -->
  <!-- of difference between methods. It is calculated by -->
  <!-- $$ -->
  <!--   \mbox{MCSE} = \hat{\mbox{sd}}(\mbox{Bias}^2)/\sqrt{N}, -->
  <!-- $$ -->
  <!-- where $\hat{\mbox{sd}}$ is the sample standard deviation and -->
  <!-- $\mbox{Bias} = \hat{\gamma}_{ij} - \gamma_{ij}$ and $N$ is the number -->
  <!-- of simulations. -->

  <!-- --- &twocol -->

  <!-- ## Results -->

  <!-- *** left -->

  <!-- - Ours and BZ are closer to the true value for all quantiles from 10% to 90%. -->
  <!-- - Under normal errors, the -->
  <!-- proposed methods dominates both *RQ* and *BZ* in most cases for -->
  <!-- MAR, incorrect MAR, and MNAR. -->
  <!-- - For the heavier tail distributions,our approach shows better -->
  <!-- performance in middle quantiles and worse performance for extreme -->
  <!-- quantiles for observed data $Y_1$. -->
  <!-- - Our algorithm provides larger gains over *RQ* function for -->
  <!-- each marginal quantile for the second component $Y_2$, which is -->
  <!-- missing for some units, since *RQ* implicitly assumes MAR missingness. -->

  <!-- *** right -->

  <!-- - The difference in MSE becomes larger for the upper quantiles because -->
  <!-- $Y_2 |R = 0$ tends to be larger than $Y_2 | R = 1$; therefore, the -->
  <!-- *RQ* method using only the observed $Y_2$ yields larger bias for upper -->
  <!-- quantiles. -->
  <!-- - Bottai's approach does much better than *rq* function for missing -->
  <!-- data because it imputes missing responses under MAR. -->
  <!-- - It also has smaller MSE than ours on extreme -->
  <!-- quantiles when distribution has heavy tail. -->
  <!-- - Our approach has advantages in the middle quantiles (30% - 70%). -->
  <!-- - We also see more gains over *BZ* in the quantile regression -->
  <!-- slope estimates for $Y_2$. -->

  <!-- --- -->

  <!-- ## Goodness of Fit Check -->

  <!-- - [ ] insert sample QQ plots here -->

  <!-- - To assess the goodness of fit, we examined the QQ plot of fitted -->
  <!-- residuals to check the normality assumption on the error term for a -->
  <!-- random sample of the simulated datasets. -->
  <!-- - When our error assumption is correct (normal), the QQ plot reflects -->
  <!-- the fitted residuals follow exact a normal distribution. -->
  <!-- - However, when we misspecified the error distribution, the proposed -->
  <!-- diagnostic method did clearly suggest heavier tail error than normal, -->
  <!-- and this also demonstrates why our approach has some disadvantages for -->
  <!-- regression on extreme quantiles when errors are not normal. -->
#+END_HTML




